## Introduction

Your work as a data professional for the U.S. Environmental Protection Agency (EPA) requires you to analyze air quality index data collected from the United States and Mexico.

The air quality index (AQI) is a number that runs from 0 to 500. The higher the AQI value, the greater the level of air pollution and the greater the health concern. For example, an AQI value of 50 or below represents good air quality, while an AQI value over 300 represents hazardous air quality. Refer to this guide from [AirNow.gov](https://www.airnow.gov/aqi/aqi-basics/) for more information.

In this lab, you will practice working in pandas. You will load a dataframe, examine its metadata and summary statistics, and explore it using iloc indexing and sorting. You will also practice Boolean masking, grouping, and concatenating data.

## Task 1: Read data from csv file into a pandas dataframe

You are given two files of data. Begin with the first file, which contains the three states with the most observations (rows): California, Texas, and Pennsylvania.

### 1a: Import statements

Import numpy and pandas. Use their standard aliases.

### 1b: Read in the first file

1. As shown in this cell, the dataset has been automatically loaded in for you. You do not need to download the .csv file, or provide more code, in order to access the dataset and proceed with this lab. Please continue with this activity by completing the following instructions.

2. Use the `head()` method on the `top3` dataframe to inspect the first five rows.

In [1]:
import kagglehub
import numpy as np
import pandas as pd


top3 = pd.read_csv('/Users/michalbando/Downloads/Różne/IT/Google Advanced Data Analytics/Datasets/epa_ca_tx_pa.csv')


top3.head(3)

/Users/michalbando/Downloads/Różne/IT/Google Advanced Data Analytics/google_course_env/lib/python3.14/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

   state_code  state_name  county_code county_name   aqi
0           6  California            1     Alameda  11.0
1           6  California            7       Butte   6.0
2           6  California           19      Fresno  11.0

### 2a: Metadata

Use a DataFrame method to examine the number of rows and columns, the column names, the data type contained in each column, the number of non-null values in each column, and the amount of memory the dataframe uses.

In [ ]:
# number of rows and columns,
# the column names,
# the data type contained in each column,
# the number of non-null values in each column,
# and the amount of memory the dataframe uses.

print(f'Rows: {top3.shape[0]}')
print(f'Columns: {top3.shape[1]}')
print(top3.columns)
print()

top3.info()
# top3.isna().sum()

# memory usage: 21.5+ KB

Rows: 546
Columns: 5
Index(['state_code', 'state_name', 'county_code', 'county_name', 'aqi'], dtype='object')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 546 entries, 0 to 545
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   state_code   546 non-null    int64
 1   state_name   546 non-null    object
 2   county_code  546 non-null    int64
 3   county_name  546 non-null    object
 4   aqi          546 non-null    float64
dtypes: float64(1), int64(2), object(2)
memory usage: 21.5+ KB

### 2b: Summary statistics

Examine the summary statistics of the dataframe's numeric columns. The output should be a table that includes row count, mean, standard deviation, min, max, and quartile values.

In [20]:
top3.describe()

       state_code  county_code         aqi
count  546.000000   546.000000  546.000000
mean    20.593407    83.179487    8.906593
std     19.001484    92.240873    9.078479
min      6.000000     1.000000    0.000000
25%      6.000000    29.000000    3.000000
50%      6.000000    66.000000    6.000000
75%     42.000000    98.500000   11.000000
max     48.000000   479.000000   93.000000

## Task 3: Explore your data

Practice exploring your data by completing the following exercises.

### 3a: Rows per state

Select the `state_name` column and use the `value_counts()` method on it to check how many rows there are for each state in the dataframe.

In [21]:
top3['state_name'].value_counts()

state_name
California      342
Texas           104
Pennsylvania    100
Name: count, dtype: int64

### 3b: Sort by AQI

1.  Create a new dataframe called `top3_sorted` by using the `sort_values()` method on the `top3` dataframe. Refer to the [sort_values pandas documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html#) for more information about how to use this method.
    *  The new dataframe should contain the data sorted by AQI, beginning with the rows with the highest AQI values.
2.  Print the top 10 rows of `top3_sorted`.

In [27]:
top3_sorted = top3.sort_values(by='aqi',ascending=False).reset_index()
top3_sorted.head(10)

   index  state_code  state_name  county_code    county_name   aqi
0     76           6  California           37    Los Angeles  93.0
1    146           6  California           37    Los Angeles  59.0
2     41           6  California           83  Santa Barbara  47.0
3    122           6  California           59         Orange  47.0
4    184           6  California           59         Orange  47.0
5     51          48       Texas          141        El Paso  47.0
6     80           6  California           65      Riverside  43.0
7    136          48       Texas          141        El Paso  40.0
8     58           6  California           65      Riverside  40.0
9     91          48       Texas          141        El Paso  40.0

### 3c: Use `iloc` to select rows

Use `iloc` to select the two rows at indices 10 and 11 of the `top3_sorted` dataframe.

In [28]:
top3_sorted.iloc[10:12]

    index  state_code  state_name  county_code  county_name   aqi
10    186           6  California           73    San Diego  39.0
11     74           6  California           37  Los Angeles  38.0

## Task 4: Examine California data

You notice that the rows with the highest AQI represent data from California, so you want to examine the data for just the state of California.

In [40]:
top3_sorted[top3_sorted['state_name']=='California']

     index  state_code  state_name  county_code    county_name   aqi
0       76           6  California           37    Los Angeles  93.0
1      146           6  California           37    Los Angeles  59.0
2       41           6  California           83  Santa Barbara  47.0
3      122           6  California           59         Orange  47.0
4      184           6  California           59         Orange  47.0
..     ...         ...         ...          ...            ...   ...
537    485           6  California           59         Orange   0.0
539    286           6  California           25       Imperial   0.0
540    378           6  California           25       Imperial   0.0
542    441           6  California           83  Santa Barbara   0.0
545     56           6  California           45      Mendocino   0.0

[342 rows x 6 columns]

### 4a: Basic Boolean masking

1. Create a Boolean mask that selects only the observations of the `top3_sorted` dataframe that are from California.
2. Apply the Boolean mask to the `top3_sorted` dataframe and assign the result to a variable called `ca_df`.
3. Print the first five rows of `ca_df`.

In [58]:
mask = top3_sorted['state_name']=='California'
ca_df = top3_sorted[mask]
ca_df.reset_index(drop=True).head(5)

   index  state_code  state_name  county_code    county_name   aqi
0     76           6  California           37    Los Angeles  93.0
1    146           6  California           37    Los Angeles  59.0
2     41           6  California           83  Santa Barbara  47.0
3    122           6  California           59         Orange  47.0
4    184           6  California           59         Orange  47.0

### 4b: Validate CA data

Inspect the shape of your new `ca_df` dataframe. Does its row count match the number of California rows determined in Task 3a?

In [59]:
print(f'CA_DF Shape: {ca_df.shape}')
print(f'Original DF Shape: {top3_sorted.shape}')

CA_DF Shape: (342, 6)
Original DF Shape: (546, 6)

### 4c: Rows per CA county

Examine a list of the number of times each county is represented in the California data.

### 4d: Calculate mean AQI for Los Angeles county

You notice that Los Angeles county has more than twice the number of rows of the next-most-represented county in California, and you want to learn more about it.

*  Calculate the mean AQI for LA county.

## Task 5: Groupby

Group the original dataframe (`top3`) by state and calculate the mean AQI for each state.

## Task 6: Add more data

Now that you have performed a short examination of the file with AQI data for California, Texas, and Pennsylvania, you want to add more data from your second file.

### 6a: Read in the second file

1. Read in the data for the remaining territories. The file is called `'epa_others.csv'` and is already in your working directory. Assign the resulting dataframe to a variable named `other_states`.

2. Use the `head()` method on the `other_states` dataframe to inspect the first five rows.

### 6b: Concatenate the data

The data from `other_states` is in the same format as the data from `top3`. It has the same columns in the same order.

1. Add the data from `other_states` as new rows beneath the data from `top3`. Assign the result to a new dataframe called `combined_df`.

2. Verify that the length of `combined_df` is equal to the sum of the lengths of `top3` and `other_states`.

## Task 7: Complex Boolean masking

According to the EPA, AQI values of 51-100 are considered of "Moderate" concern. You've been tasked with examining some data for the state of Washington.

*  Use Boolean masking to return the rows that represent data from the state of Washington with AQI values of 51+.